# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [2]:
# 記得先 Import 正確的套件

import numpy as np
import pandas as pd

In [42]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [43]:
animalAVG=df["animal"]
print("cat age",df[animalAVG=="cat"]["age"].mean())
print("dog age",df[animalAVG=="dog"]["age"].mean())
print("snake age",df[animalAVG=="snake"]["age"].mean())

cat age 2.5
dog age 5.0
snake age 2.5

In [45]:
df2=df.sort_values(by=['age'])

df3=df2.sort_values(by=["visits"],ascending=False)
print(df3)

  animal  age  visits priority
f    cat  2.0       3       no
b    cat  3.0       3      yes
d    dog  NaN       3      yes
c  snake  0.5       2       no
e    dog  5.0       2       no
i    dog  7.0       2       no
a    cat  2.5       1      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
h    cat  NaN       1      yes

In [30]:
df["priority"]=df["priority"].str.replace("yes","True")
df["priority"]=df["priority"].str.replace("no","False")
df

  animal  age  visits priority
a    cat  2.5       1     True
b    cat  3.0       3     True
c  snake  0.5       2    False
d    dog  NaN       3     True
e    dog  5.0       2    False
f    cat  2.0       3    False
g  snake  4.5       1    False
h    cat  NaN       1     True
i    dog  7.0       2    False
j    dog  3.0       1    False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [3]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.825900  0.672863  0.096298
1  0.311222  0.355998  0.761184
2  0.494828  0.744921  0.565651
3  0.761437  0.867192  0.080225
4  0.128028  0.535140  0.986566

In [9]:
df4=df.apply(lambda x : x-x.mean(axis=0))
df4

          0         1         2
0  0.321617  0.037640 -0.401687
1 -0.193061 -0.279225  0.263199
2 -0.009455  0.109698  0.067667
3  0.257154  0.231969 -0.417760
4 -0.376255 -0.100083  0.488581

In [12]:
row=df.mean(axis=1)
df5=df-row
df5

          0         1         2   3   4
0  0.294213  0.196729 -0.505502 NaN NaN
1 -0.220465 -0.120137  0.159384 NaN NaN
2 -0.036859  0.268786 -0.036149 NaN NaN
3  0.229750  0.391057 -0.521575 NaN NaN
4 -0.403658  0.059006  0.384766 NaN NaN

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [13]:
df

          0         1         2
0  0.825900  0.672863  0.096298
1  0.311222  0.355998  0.761184
2  0.494828  0.744921  0.565651
3  0.761437  0.867192  0.080225
4  0.128028  0.535140  0.986566

In [14]:
df6=df.sum(axis=0)
df6

0    2.521415
1    3.176114
2    2.489924
dtype: float64

In [15]:
df7=df.sum(axis=1)
df7

0    1.595061
1    1.428404
2    1.805400
3    1.708854
4    1.649734
dtype: float64